Autodesk.Revit.DB.Category.CategoryType
Gets the category type of this category.
Remarks:
The category type determines if the category is shown in the Visibility/Graphics settings
grouped with the model,annotation, or analytical model categories.
Note that import categories are also "model" but will be shown separately in the dialog.
Some categories not shown in the dialog and will return Internal for the category type.
Since:
2015

Autodesk.Revit.DB.Category.IsTagCategory
Identifies if the category is associated with a type of tag for a different category.
True if the category is associated with a type of tag for a different category, false if not.
Since:
2015

Autodesk.Revit.DB.Category.HasMaterialQuantities
Identifies if elements of the category are able to report what materials they contain in what quantities.
Remarks:
Get materials via the Element' property Materials;
Get quantities via methods GetMaterialArea and GetMaterialVolume.

Autodesk.Revit.DB.Category.AllowsVisibilityControl(Autodesk.Revit.DB.View)
Whether the visibility can be controlled by the user for this category in this view.
Remarks: There are some categories in Revit that are hidden to users in the Object Styles and
Visibility dialog. Their visibility cannot be controlled for a particular view. This property
identifies if the category allows visibility control (and thus allows the Visible property to
be set).
view: The view where visibility control might be allowed.

Autodesk.Revit.DB.Category.AllowsBoundParameters
To check if the category can have project parameters.

Autodesk.Revit.DB.Category.Visible(Autodesk.Revit.DB.View)
Retrieves or changes the visibility of the category in the active view.
Remarks: This affects only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
the category classes settings for
model categories, annotation categories, import categories or analytical model categories.view filters
Thus setting this value may not affect the actual visibility of elements of this category in the view.

Autodesk.Revit.DB.Category.Material
Retrieves or changes the material of the category.
null if this category does not have a material.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: When setting this property: material cannot be set for annotation categories.

Autodesk.Revit.DB.Category.Id
Returns the category id associated with the category object.

Autodesk.Revit.DB.Category.Parent
Returns the parent category of this category.
Returns:
null if this category a not a subcategory

Autodesk.Revit.DB.Category.SubCategories
Returns a map containing all of the subcategories of this category.
Returns: An empty map if the category has no subcategories.

Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Retrieves a category object corresponding to the category id.
document: The document.
categoryId: An category id.
Returns: Returns a category object corresponding to the category id.
Since:  2016

Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object corresponding to a BuiltInCategory id.
document: The document.
categoryId: A build in category id.
Returns: Returns a category object corresponding to a BuiltInCategory id.
Since:  2016

Autodesk.Revit.DB.Category.GetGraphicsStyle(Autodesk.Revit.DB.GraphicsStyleType)
Gets the graphics style associated with this category for the given graphics style type.
graphicsStyleType: The type of graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"graphicsStyleType"-is out of range.

Autodesk.Revit.DB.Category.SetLinePatternId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.GraphicsStyleType)
Sets the line pattern id associated with this category for the given graphics style type.
Remarks:
The line pattern id will be one of the following:
A negative value (representing a built-in line pattern); this value can only be obtained via GetLinePatternId
The id of a LinePatternElement
linePatternId: The line pattern id for the graphics style.
graphicsStyleType: The type of graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument "linePatternId" is an illegal id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this category does not have stored line pattern id for this graphics style type.
Since:  2017

Autodesk.Revit.DB.Category.GetLinePatternId(Autodesk.Revit.DB.GraphicsStyleType)
Gets the line pattern id associated with this category for the given graphics style type.
Remarks:
The line pattern id will be one of the following:
A negative value (representing a built-in line pattern)
The id of a LinePatternElement
InvalidElementId, indicating that this category does not have a stored line pattern id for this graphics style type.
graphicsStyleType: The type of graphics style.
Returns: Returns the line pattern id associated with this category for the given graphics style type.
Since:  2017

Autodesk.Revit.DB.Category.SetLineWeight(System.Int32,Autodesk.Revit.DB.GraphicsStyleType)
Sets the line weight for the given graphics style type.
graphicsStyleType: The type of graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"lineWeight" or "graphicsStyleType"-is out of range.

Autodesk.Revit.DB.Category.GetLineWeight(Autodesk.Revit.DB.GraphicsStyleType)
Retrieves the line weight assigned to the category for the given graphics style type.
graphicsStyleType: The type of graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"graphicsStyleType"-is out of range.

Autodesk.Revit.DB.Category.CanAddSubcategory
Indicates if subcategories can be assigned to the category.

Autodesk.Revit.DB.Category.IsCuttable
Indicates if the category is cuttable or not.

Autodesk.Revit.DB.Category.LineColor
The color of lines shown for elements of this category.

Autodesk.Revit.DB.Category.Name
The category name.

Autodesk.Revit.DB.Category
Represents the category or subcategory to which an element belongs.
Remarks: Categories are an import tool within Revit for identifying the inferred type of an
element, such as anything in the Walls category should be considered as a wall. The API
exposes access to the built in categories within Revit via the Document.Settings.Categories
property.